Autodesk.Revit.DB.BuiltInFailures.OverlapFailures.ToposolidSubregionOverlap
Highlighted toposolid and sub-division overlap.

Autodesk.Revit.DB.BuiltInFailures.OverlapFailures.ToposolidOverlap
Highlighted toposolid overlap.

Autodesk.Revit.DB.BuiltInFailures.OverlapFailures.ToposolidFloorOverlap
Highlighted toposolid and floor overlap.

Autodesk.Revit.DB.BuiltInFailures.OverlapFailures.SubregionOverlap
Highlighted sub-division overlap.

Autodesk.Revit.DB.BuiltInFailures.OverlapFailures.ELASeparationLinesOverlap
Highlighted area based load boundary lines overlap. One of them may be ignored when Revit finds load area boundaries. Delete one of the lines.